In [1]:
import pandas as pd
df= pd.read_excel(r"C:\Users\Lenovo\Downloads\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [2]:
df['Temperature_C'].max()

34

In [3]:
df['Temperature_C'].min()

28

In [4]:
df['Temperature_C'].mean()

np.float64(30.9)

In [5]:
df['Temperature_C'].std()

1.911950719959998

In [6]:
df['Temperature_C'].var()

3.6555555555555554

In [7]:
df['Temperature_C'].describe()

count    10.000000
mean     30.900000
std       1.911951
min      28.000000
25%      29.250000
50%      31.000000
75%      32.000000
max      34.000000
Name: Temperature_C, dtype: float64

In [8]:
df[df.Temperature_C==df.Temperature_C.max()]

        Date      City  Temperature_C  Humidity_% Condition
6 2025-01-07  Banglore             34          61     Sunny

In [9]:
df.City[df.Temperature_C==df.Temperature_C.max()]

6    Banglore
Name: City, dtype: object

In [10]:
df.count()

Date             10
City             10
Temperature_C    10
Humidity_%       10
Condition        10
dtype: int64

In [11]:
df.count()

Date             10
City             10
Temperature_C    10
Humidity_%       10
Condition        10
dtype: int64

## String Cleaning

In [12]:
df["City"]=df["City"].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     Sunny
1 2025-01-02    HYDERBAD             29          62     Sunny
2 2025-01-03    HYDERBAD             30          58    Cloudy
3 2025-01-04    HYDERBAD             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

In [13]:
df["City"]=df["City"].str.replace("HYDERABAD", "CHENNAI") 
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     Sunny
1 2025-01-02    HYDERBAD             29          62     Sunny
2 2025-01-03    HYDERBAD             30          58    Cloudy
3 2025-01-04    HYDERBAD             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

## Concate Data frames

In [19]:
india_weather = pd.DataFrame({"city" : ["mumbai","bangalore","Hyderabad"],
                              "Temperature":[32,45,35]})
india_weather

        city  Temperature
0     mumbai           32
1  bangalore           45
2  Hyderabad           35

In [16]:
US_weather = pd.DataFrame({
    "city" : ["New York","Chicago","orlando"],
    "Temperature":[32,45,35]
})
US_weather

       city  Temperature
0  New York           32
1   Chicago           45
2   orlando           35

In [20]:
df = pd.concat([india_weather,US_weather],ignore_index=True)
df

        city  Temperature
0     mumbai           32
1  bangalore           45
2  Hyderabad           35
3   New York           32
4    Chicago           45
5    orlando           35

In [21]:
df = pd.concat([india_weather,US_weather],axis=1)
df

        city  Temperature      city  Temperature
0     mumbai           32  New York           32
1  bangalore           45   Chicago           45
2  Hyderabad           35   orlando           35

## Merge DataFrames

In [24]:
temp_df = pd.DataFrame({
    "city":["Hyderabad","Vijayawada","Vishakapatnam","Bengaluru"],
    "temperature":[62,65,60,75]
})
temp_df

            city  temperature
0      Hyderabad           62
1     Vijayawada           65
2  Vishakapatnam           60
3      Bengaluru           75

In [25]:
humidity_df = pd.DataFrame({
    "city":["Hyderabad","Vijayawada","Vishakapatnam","Bengaluru"],
    "humidity":[62,65,60,75]
})
humidity_df

            city  humidity
0      Hyderabad        62
1     Vijayawada        65
2  Vishakapatnam        60
3      Bengaluru        75

In [26]:
df = pd.merge(temp_df,humidity_df,on="city")
df

            city  temperature  humidity
0      Hyderabad           62        62
1     Vijayawada           65        65
2  Vishakapatnam           60        60
3      Bengaluru           75        75

In [27]:
df = pd.merge(temp_df,humidity_df,on="city",how="outer")
df

            city  temperature  humidity
0      Bengaluru           75        75
1      Hyderabad           62        62
2     Vijayawada           65        65
3  Vishakapatnam           60        60

In [28]:
df.isnull()

    city  temperature  humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False

In [29]:
df.isnull().sum()

city           0
temperature    0
humidity       0
dtype: int64

In [30]:
df['temperature']=df['temperature'].fillna(df.temperature.min())

In [31]:
df.isnull()

    city  temperature  humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False

In [32]:
df

            city  temperature  humidity
0      Bengaluru           75        75
1      Hyderabad           62        62
2     Vijayawada           65        65
3  Vishakapatnam           60        60